import os, sys

sys.path.append(os.path.dirname(os.path.abspath(os.path.dirname(__file__))))


# 검증 데이터
VERIFICATION_24_SEASONS_DATES = {
    "입춘": '2023-01-30',
    "우수": '2020-02-23',  # '2023-03-02' 희망편 '2023-02-25' 절망편
    "경칩": '2023-03-02',  # '2023-03-02' 희망편 '2023-03-05' 절망편
    "춘분": '2020-03-18',  # '2023-03-21' '2020-03-18' 절망편
    "청명": '',
    "곡우": '',
    "입하": '',
    "소만": '2023-05-15',
    "망종": '2019-06-03',  # 2019-06-03, '2022-05-13'
    "하지": '',
    "소서": '',
    '대서': '',
    '입추': '',
    '처서': '',
    '백로': '',
    '추분': '2019-09-18',  # '2022-10-12'
    '한로': '2022-10-12',
    '상강': '2022-10-18',
    '입동': '',
    '소설': '',
    '대설': '',
    '동지': '2022-12-24',  # '2021-12-22', '2022-12-24', '2020-12-19'
    '소한': '',
    '대한': '',

}



# def calculateClearDayOpticalRegression(data, field_x, field_y, ):


